Normalization is generally required when we are dealing with attributes on a different scale. To perform normalization, we can use:
1. Z-score 
2. Scaling of data
3. Min-Max normalization

In [2]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame([
                   [300000, 567, 15.9, 2340], 
                   [123400, 985, 56.4, 8970], 
                   [230000, 123, 14.0, 4543], 
                   [675670, 876, 87.5, 1675],
                   [567887, 666, 56.8, 1255]],
    
                   columns=['A','B','C','D'])
df

        A    B     C     D
0  300000  567  15.9  2340
1  123400  985  56.4  8970
2  230000  123  14.0  4543
3  675670  876  87.5  1675
4  567887  666  56.8  1255

# Scaling of data by maximum absolute value

In [10]:
df_norm=df.copy()

for col in df_norm:
  df_norm[col]=df_norm[col]/df_norm[col].abs().max()

df_norm

          A         B         C         D
0  0.444004  0.575635  0.181714  0.260870
1  0.182634  1.000000  0.644571  1.000000
2  0.340403  0.124873  0.160000  0.506466
3  1.000000  0.889340  1.000000  0.186734
4  0.840480  0.676142  0.649143  0.139911

# Z-score scaling

In [11]:
df_z=df.copy()

for col in df_z:
  df_z[col]=(df_z[col] -df_z[col].mean()) / df_z[col].std() 

df_z

          A         B         C         D
0 -0.340494 -0.228300 -0.970683 -0.445768
1 -1.097897  1.020774  0.330199  1.640526
2 -0.640711 -1.555067 -1.031712  0.247460
3  1.270681  0.695059  1.329148 -0.655027
4  0.808421  0.067534  0.343047 -0.787191

# Min-max scaling

In [12]:
df_mm=df.copy()

for col in df_mm:
  df_mm[col]=(df_mm[col] - df_mm[col].min()) / (df_mm[col].max() - df_mm[col].min())  

df_mm

          A         B         C         D
0  0.319771  0.515081  0.025850  0.140635
1  0.000000  1.000000  0.576871  1.000000
2  0.193022  0.000000  0.000000  0.426183
3  1.000000  0.873550  1.000000  0.054439
4  0.804836  0.629930  0.582313  0.000000